000100190303     FMHWYDSP   CF   E             WORKSTN
000101190303      /FREE
000102190303          EXFMT MTOLLINFO;
000104190303          DOW NOT(*IN03);
000105190303            *IN99 = *ON;
000113190303            EXSR CALCULATE;
000114190303            WRITE MTOLLINFO;
000115190303            EXFMT MSHOWTOLL;
000116190303            IF NOT(*IN03);
000117190303              *IN99 = *OFF;
000118190303              EXSR CLEAR;
000119190303              EXFMT MTOLLINFO;
000120190303            ENDIF;
000121190303          ENDDO;
000122190303          *INLR = *ON;
000123190303          RETURN;
000124190303
000125190303          BEGSR CALCULATE;
000126190303            EXSR TRANHOUR;
000127190303            EXSR GETRATE;
000128190303            EXSR CALCHARGE;
000129190303            EXSR CALTRANSF;
000130190303            EXSR CALTOTAL;
000131190303          ENDSR;
000132190303
000133190303          BEGSR TRANHOUR;
000134190303            SELECT;
000135190303              WHEN (AMPM = 'AM') and (HOUR = 12);
000136190303                HOUR = 0;
000137190303              WHEN (AMPM = 'PM') and (HOUR <> 12);
000140190303                HOUR = HOUR + 12;
000141190303              OTHER;
000142190303                HOUR = HOUR;
000143190303            ENDSL;
000144190303          ENDSR;
000145190303
000146190303          BEGSR GETRATE;
000147190303            SELECT;
000148190303              WHEN VEHICLE = 'L';
000149190303                EXSR GETLRATE;
000150190303              WHEN VEHICLE = 'H';
000151190303                EXSR GETHRATE;
000152190303              WHEN VEHICLE = 'M';
000153190303                EXSR GETMRATE;
000154190303            ENDSL;
000155190303          ENDSR;
000156190303
000157190303          BEGSR GETLRATE;
000158190303            SELECT;
000159190303              WHEN ( HOUR >= 6 ) and ( HOUR < 9 );
000160190303                 TOLLRATE = 0.3707;
000161190303              WHEN ( HOUR >= 9 ) and ( HOUR < 10 );
000162190303                 TOLLRATE = 0.3259;
000163190303              WHEN ( HOUR >= 10) and ( HOUR < 16);
000164190303                 TOLLRATE = 0.2833;
000165190303              WHEN ( HOUR >= 16) and ( HOUR < 19);
000166190303                 TOLLRATE = 0.3842;
000167190303              OTHER;
000168190303                 TOLLRATE = 0.2162;
000169190303            ENDSL;
000170190303          ENDSR;
000171190303
000172190303          BEGSR GETHRATE;
000173190303            SELECT;
000174190303              WHEN ( HOUR >= 6 ) and ( HOUR < 9 );
000175190303                 TOLLRATE = 0.7418;
000176190303              WHEN ( HOUR >= 9 ) and ( HOUR < 10 );
000177190303                 TOLLRATE = 0.6518;
000178190303              WHEN ( HOUR >= 10) and ( HOUR < 16);
000179190303                 TOLLRATE = 0.5666;
000180190303              WHEN ( HOUR >= 16) and ( HOUR < 19);
000181190303                 TOLLRATE = 0.7683;
000182190303              OTHER;
000183190303                 TOLLRATE = 0.4324;
000184190303            ENDSL;
000185190303          ENDSR;
000186190303
000187190303          BEGSR GETMRATE;
000188190303            SELECT;
000189190303              WHEN ( HOUR >= 6 ) and ( HOUR < 9 );
000190190303                 TOLLRATE = 1.1122;
000191190303              WHEN ( HOUR >= 9 ) and ( HOUR < 10 );
000192190303                 TOLLRATE = 0.9778;
000193190303              WHEN ( HOUR >= 10) and ( HOUR < 16);
000194190303                 TOLLRATE = 0.8499;
000195190303              WHEN ( HOUR >= 16) and ( HOUR < 19);
000196190303                 TOLLRATE = 1.1525;
000197190303              OTHER;
000198190303                 TOLLRATE = 0.6586;
000199190303            ENDSL;
000200190303          ENDSR;
000201190303
000202190303          BEGSR CALCHARGE;
000203190303            TOLLCHARGE = KILOMETERS * TOLLRATE;
000204190303          ENDSR;
000205190303
000206190303          BEGSR CALTRANSF;
000207190303            SELECT;
000208190303              WHEN TRANSPNDR = 'N';
000209190303                NOTRANSF = 4.07;
000210190303              WHEN TRANSPNDR = 'Y';
000211190303                NOTRANSF = 0;
000212190303            ENDSL;
000213190303          ENDSR;
000214190303
000215190303          BEGSR CALTOTAL;
000216190303            TOTALDUE = TOLLCHARGE + NOTRANSF;
000217190303          ENDSR;
000218190303
000219190303          BEGSR CLEAR;
000220190303            *IN99 = *OFF;
000221190303            KILOMETERS = 0;
000222190303            VEHICLE = '';
000223190303            HOUR = 0;
000224190303            AMPM = '';
000225190303            TRANSPNDR = '';
000226190303            TOLLRATE = 0;
000227190303            TOLLCHARGE = 0;
000228190303            NOTRANSF = 0;
000229190303            TOTALDUE = 0;
000231190303          ENDSR;
000232190303      /END-FREE
