000100190308     A          R ALLSHIFT                  PFILE(SENECAPAY/ALLSHIFT)
000101190321     A          K HRSWORKED
000102190308     A          S WORKSHIFT                 COMP(EQ 'D')
